Revit 2027 API
HVACLoadBuildingType.IsNameUnique Method
Overload List
Name | Description
IsNameUnique(String) |  Determines whether a potential building type name is unique.
IsNameUnique(Document, String) |  Determines whether a potential building type name is unique.
Top
See Also
Reference
HVACLoadBuildingType Class
Autodesk.Revit.DB.Analysis Namespace